{
    "name" : "Neev Shah",
    "projects":{
        "subHeading": "My Projects",
        "text":"A PROJECT IS COMPLETE WHEN IT STARTS WORKING FOR YOU, RATHER THAN YOU WORKING FOR IT.",
        "project":[
            {
              "id": 1,
              "heading": "A Blockchain Based E-Voting platform",
              "title":"ElectChain",
              "link":"https://play.google.com/store/apps/details?id=com.welcomebroker.welcome_broker&pli=1",
              "text":[
                "Designed and developed a blockchain-based E-Voting android application.",
                "Implemented features like proof of work based secured voting transactions, also managing the registration, voting, and results."
              ],
              "Used" : "Used: Kotlin, Node.Js, Solidity, Metamask, Ropston Test Network."                  
            },
            {
              "id": 2,
              "heading": "A Blogging Website for travellers",
              "title":"Nomadic",
              "link":"https://github.com/neevshah1273/Nomadic",
              "text":[
                "Designed, built and deployed a MERN stack-based web application to store and explore travel Blogs.",
                "Implemented email login using JWT and OAuth Google login for user authentication.",
                "Set up database with Mongo DB Atlas to store users, post and implement its edit, upvote and delete functionality."
              ],
              "Used" : "Used: React, Node, Express, MongoDB (mongoose, Atlas), Redux."                  
            },
            {
              "id": 3,
              "heading": "browsering timelapses",
              "title": "Timeflux",
              "link":"https://github.com/ParthPrajapati43/WebT_Project_Timeflux",
              "text":[
                  "Developed a React application to explore slow Mo and Time-Lapse videos.",
                  "Implemented email login using Firebase.",
                  "Set up database with Firebase to store information of user, posts and comments."
              ],
              "Used": "Used: ReactJs, Google Firebase."
          },
          {
            "id": 4,
            "heading": "personal Portfolio",
            "title":"Portfolio",
            "link":"https://github.com/neevshah1273/neev3",
            "text": [
                "Developed Personal Portfolio using ReactJs",
                "Explored tailwind-css for the styling"
            ],
            "Used": "Used: ReactJs, TailWindCSS."
          },
          {
            "id": 5,
            "heading": "Localify",
            "title":"Grocery Delivery App",
            "link":"",
            "text": [
                "Developed application to find nearby stores and their real time stock",
                "The app allowed users to order groceries from the nearby stores"
            ],
            "Used": "Used: Flutter, MongoDB, NodeJs, ExpressJs."
           },
           {
            "id": 6,
            "heading": "Visulization of algorithm",
            "title": "CPU Scheduling Algorithm App",
            "link":"https://github.com/neevshah1273/CPU-Scheduling",
            "text":[
                "Solve problems of CPU Scheduling algorithm, solution will show you which process is at which state at every point of time.",
                "It helps to understand how CPU Scheduling algorithms works."
            ],
            "Used": "Used: Flutter."
          },
          {
            "id": 7,
            "heading": "fantasy auction simullator",
            "title": "Auction11",
            "link":"",
            "text":[
              "Developed API for the fantasy auction simullator",
              "Developed using NodeJs, ExpressJs and MongoDB"
            ],
            "Used": "Used : NodeJs, ExpressJs, Mongo DB"
          },
          {
            "id": 8,
            "heading": "Game Development",
            "title": "AirHockey",
            "link":"https://github.com/neevshah1273/AIRHOCKY",
            "text":[
              "Developed Airhockey using Java"
            ],
            "Used": "Used: java."
          },
          {
            "id": 9,
            "heading": "programming language",
            "title": "Sanskritava",
            "link":"",
            "text":[
              "By leveraging Java as the underlying implementation language and incorporating the Sanskrit-inspired syntax, the project aimed to enable developers to write code that closely aligns with natural language patterns while achieving the desired program outcomes.",
              "Designed grammer and parsed using antlr",
              "The language will provide support for basic operations such as arithmetic calculations, variable assignment, and conditional statements.",
              "Created a functional programming language in Java, utilizing an intermediate code representation for efficient execution and translation of sample code into the expected output."
            ],
            "Used": "Used: Java, Antlr"
          },
          {
            "id": 9,
            "heading": "Full Stack Development",
            "title": "Crimelens",
            "link":"",
            "text":[
              "Developed a data visualization dashboard which shows the various studies of crime in the US using Next.Js with D3.Js & integrated with Java based backend.",
              "Preprocessed the 3 datasets, prepared the ontology according to the datasets, created a Knowledge graph, hosted it on the Apache Jena Fuskei server, and ran the SPARQL queries to fetch open linked data from the Apache Jena."
            ],
            "Used": "NextJs, Java, Apache Jena Fuseki, D3.Js, SPARQL, OWL"
          }
        ]
    },
    "Experience" : [
        {
          "position" : "Software Engineer",
          "company" : "Welcome Broker",
          "location" : "Remote",
          "Duration" : "June, 2022 - Dec, 2023",
          "Details" : ["Engineered business management application, which included features such as order management, data analysis tools, and a notification system which resulted in the increase of the order accuracy rate from 75% to 99.96%.",
                        "Spearheaded the end-to-end development of a comprehensive application, overseeing project management, designing the software architecture, implementing code, and testing.",
                        "Improved the response times by 90% through implementation of Redis based caching mechanism."
                      ],
          "Tech_Stacks" : [
            "Flutter",
            "NodeJs",
            "MongoDB",
            "docker",
            "AWS",
            "Redis",
            "Firebase Clould Messaging"
          ]
        },
        {
          "position" : "Software Engineering Intern",
          "company" : "Apice Tech Pvt Ltd",
          "location" : "Delhi, India",
          "Duration" : "January, 2022 - May, 2022",
          "Details" : ["Programmed features like a project management tool, CI/CD flow management, and testing automation management in the back-end utilizing Java working on KaizIQ project, which resulted in the increase in the bug detection up to 70%.",
                        "Developed front-end screens for features like API Testing and automated Deployment using ReactJS & Integrated with REST APIs."
                      ],
          "Tech_Stacks" : [
            "ReactJs",
            "Java SpringBoot",
            "Oracle SQL",
            "docker",
            "AWS",
            "RabbitMQ"
          ]
        }
    ],
    "Skills" : [

    ]
}